In [7]:
!pip install ipython-sql
!pip install sqlalchemy
!pip install psycopg2

Requirement already satisfied: ipython-sql in c:\users\uwizeyimana\anaconda3\lib\site-packages (0.4.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\uwizeyimana\anaconda3\lib\site-packages (from ipython-sql) (1.3.18)
Requirement already satisfied: six in c:\users\uwizeyimana\anaconda3\lib\site-packages (from ipython-sql) (1.15.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\uwizeyimana\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlparse in c:\users\uwizeyimana\anaconda3\lib\site-packages (from ipython-sql) (0.3.1)
Requirement already satisfied: ipython>=1.0 in c:\users\uwizeyimana\anaconda3\lib\site-packages (from ipython-sql) (7.16.1)
Requirement already satisfied: prettytable<1 in c:\users\uwizeyimana\anaconda3\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: pygments in c:\users\uwizeyimana\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.6.1)
Requirement already satisfied: decorator in c:\users\uwizeyimana\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (4.4.2)
Requirement already satisfied: backcall in c:\users\uwizeyimana\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=4.2 in c:\users\uwizeyimana\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (4.3.3)
Requirement already satisfied: pickleshare in c:\users\uwizeyimana\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: setuptools>=18.5 in c:\users\uwizeyimana\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (49.2.0.post20200714)
Requirement already satisfied: jedi>=0.10 in c:\users\uwizeyimana\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.17.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\uwizeyimana\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.5)
Requirement already satisfied: colorama; sys_platform == "win32" in c:\users\uwizeyimana\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.3)
Requirement already satisfied: parso<0.8.0,>=0.7.0 in c:\users\uwizeyimana\anaconda3\lib\site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.7.0)
Requirement already satisfied: wcwidth in c:\users\uwizeyimana\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: sqlalchemy in c:\users\uwizeyimana\anaconda3\lib\site-packages (1.3.18)
Requirement already satisfied: psycopg2 in c:\users\uwizeyimana\anaconda3\lib\site-packages (2.8.6)

In [1]:
%load_ext sql

In [2]:
from sqlalchemy import create_engine
import psycopg2
import pandas as pd
import numpy as np

In [3]:
%sql postgresql://jeannette:Kinglord@localhost/moodle

In [4]:
engine = create_engine('postgresql://jeannette:Kinglord@localhost/moodle')

In [5]:
%%sql
Select * From mdl_user Limit 5;

 * postgresql://jeannette:***@localhost/moodle
5 rows affected.

[(1, 1, 0, 0, 0, '', 'Germany', 'en', 0, 0, 0, 0, '', 'Male', 'DE'),
 (20, 1, 0, 0, 0, '', 'Germany', 'en', 1549745767, 1562935333, 1549745767, 1562935333, '197.215.32.111', 'Male', 'DE'),
 (15, 1, 0, 0, 0, '', 'Germany', 'en', 1549633236, 1563537002, 1563469481, 1563537002, '41.184.239.200', 'Male', 'DE'),
 (36, 1, 0, 0, 0, '', 'Ghana', 'en', 1549641288, 1559227964, 1549651186, 1559227892, '154.160.1.224', 'Male', 'GH'),
 (44, 1, 0, 0, 0, '', 'Ghana', 'en', 1549637001, 1560095090, 1557475553, 1560094908, '129.122.1.14', 'Male', 'GH')]

# Task 1

# 1.1 Counting the number of tables in a database

In [6]:
%%sql
Select COUNT(*) FROM information_schema.tables

 * postgresql://jeannette:***@localhost/moodle
1 rows affected.

[(636,)]

We have 643 tables in our database but we will explore some which are the following:
mdl_logstore_standard_log,
mdl_context,
mdl_user,
mdl_course,
mdl_modules,
mdl_course_modules,
mdl_course_modules_completion.

# 1.2counting records in each table.

In [15]:
#context records
%%sql
SELECT COUNT(*) FROM mdl_context

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(4359,)]

In [16]:
#user recorded
%%sql
SELECT COUNT(*) FROM mdl_user

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(1052,)]

In [17]:
#courses recorded
%%sql
SELECT COUNT(*) FROM mdl_course

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(15,)]

In [18]:
#modules recorded
%%sql
SELECT COUNT(*) FROM mdl_modules

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(26,)]

In [20]:
#course module recorded
%%sql
SELECT COUNT(*) FROM mdl_course_modules

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(290,)]

In [21]:
#modules completed records
%%sql
SELECT COUNT(*) FROM mdl_course_modules_completion

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(4483,)]

In [46]:
%%sql
Select * From mdl_logstore_standard_log Limit 5;

 * postgresql://postgres:***@localhost/moodle
5 rows affected.

[(1, '\\core\\event\\course_viewed', 'core', 'viewed', 'course', None, None, 'r', 2, 2, 50, 1, 0, 1, None, 0, 'N;', 1548311114, 'web', '105.233.48.139', None),
 (2, '\\core\\event\\user_loggedin', 'core', 'loggedin', 'user', 'user', 2, 'r', 0, 1, 10, 0, 2, 0, None, 0, 'a:1:{s:8:"username";s:5:"admin";}', 1548311148, 'web', '105.233.48.139', None),
 (3, '\\core\\event\\dashboard_viewed', 'core', 'viewed', 'dashboard', None, None, 'r', 0, 5, 30, 2, 2, 0, 2, 0, 'N;', 1548311179, 'web', '105.233.48.139', None),
 (4, '\\core\\event\\course_viewed', 'core', 'viewed', 'course', None, None, 'r', 2, 2, 50, 1, 0, 1, None, 0, 'N;', 1548313994, 'web', '105.233.48.139', None),
 (5, '\\core\\event\\course_viewed', 'core', 'viewed', 'course', None, None, 'r', 2, 2, 50, 1, 0, 1, None, 0, 'N;', 1548319150, 'web', '41.13.254.147', None)]

# 1.3 Number of quiz submissions by hour of day

In [50]:
%%sql
SELECT COUNT(id), EXTRACT(HOUR FROM to_timestamp(timecreated)) from mdl_logstore_standard_log
WHERE action='submitted' AND component='mod_quiz'
GROUP BY EXTRACT(HOUR FROM to_timestamp(timecreated))
ORDER BY count desc;

 * postgresql://postgres:***@localhost/moodle
24 rows affected.

[(104, 13.0),
 (95, 11.0),
 (90, 14.0),
 (88, 12.0),
 (80, 15.0),
 (70, 18.0),
 (69, 10.0),
 (68, 17.0),
 (68, 16.0),
 (57, 19.0),
 (55, 20.0),
 (53, 22.0),
 (46, 9.0),
 (46, 21.0),
 (34, 8.0),
 (30, 1.0),
 (29, 2.0),
 (26, 23.0),
 (23, 0.0),
 (18, 6.0),
 (17, 7.0),
 (14, 4.0),
 (10, 5.0),
 (7, 3.0)]

Many quizes were submitted at 13hr

# 1.4 Monthly usage time of learners who have confirmed and are not deleted

In [35]:
%%sql
SELECT * FROM mdl_user
WHERE confirmed = '1' AND deleted = '0'
LIMIT 5

 * postgresql://postgres:***@localhost/moodle
5 rows affected.

[(1, 1, 0, 0, 0, '', 'Germany', 'en', 0, 0, 0, 0, '', 'Male', 'DE'),
 (20, 1, 0, 0, 0, '', 'Germany', 'en', 1549745767, 1562935333, 1549745767, 1562935333, '197.215.32.111', 'Male', 'DE'),
 (15, 1, 0, 0, 0, '', 'Germany', 'en', 1549633236, 1563537002, 1563469481, 1563537002, '41.184.239.200', 'Male', 'DE'),
 (36, 1, 0, 0, 0, '', 'Ghana', 'en', 1549641288, 1559227964, 1549651186, 1559227892, '154.160.1.224', 'Male', 'GH'),
 (44, 1, 0, 0, 0, '', 'Ghana', 'en', 1549637001, 1560095090, 1557475553, 1560094908, '129.122.1.14', 'Male', 'GH')]

In [6]:
%%sql 
SELECT COUNT(lastaccess - firstaccess) AS usagetime, EXTRACT (MONTH FROM to_timestamp(firstaccess)) AS month 
FROM mdl_user WHERE confirmed = 1 AND deleted = 0 GROUP BY EXTRACT (MONTH FROM to_timestamp(firstaccess))

 * postgresql://postgres:***@localhost/moodle
7 rows affected.

[(58, 3.0),
 (31, 7.0),
 (450, 1.0),
 (227, 2.0),
 (27, 6.0),
 (139, 4.0),
 (112, 5.0)]

# 1.5 Count of log events per user for the following verbs: ['loggedin', 'viewed', 'started', ,'submitted', 'uploaded', 'updated', 'searched', 'resumed', 'answered', 'attempted', 'abandoned']

In [36]:
%%sql
SELECT COUNT(*)
FROM mdl_logstore_standard_log
WHERE action = 'viewed'

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(120167,)]

In [37]:
#logged in logs
%%sql
SELECT COUNT(*)
FROM mdl_logstore_standard_log
WHERE action = 'loggedin'

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(4444,)]

In [38]:
#logs in started status
%%sql
SELECT COUNT(*)
FROM mdl_logstore_standard_log
WHERE action = 'started'

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(3679,)]

In [39]:
#logs in submitted status
%%sql
SELECT COUNT(*)
FROM mdl_logstore_standard_log
WHERE action = 'submitted'

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(2288,)]

In [40]:
#logs in uploaded status
%%sql
SELECT COUNT(*)
FROM mdl_logstore_standard_log
WHERE action = 'uploaded'

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(173,)]

In [41]:
#logs in searched status
%%sql
SELECT COUNT(*)
FROM mdl_logstore_standard_log
WHERE action = 'searched'

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(14,)]

In [42]:
#logs in resumed status
%%sql
SELECT COUNT(*)
FROM mdl_logstore_standard_log
WHERE action = 'resumed'

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(1422,)]

In [43]:
#logs in answered status
%%sql
SELECT COUNT(*)
FROM mdl_logstore_standard_log
WHERE action = 'answered'

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(362,)]

In [44]:
#logs in attempted status
%%sql
SELECT COUNT(*)
FROM mdl_logstore_standard_log
WHERE action = 'attempted'

 * postgresql://postgres:***@localhost/moodle
1 rows affected.

[(0,)]

In [ ]:
# logs in abandoned status
%%sql
SELECT COUNT(*)
FROM mdl_logstore_standard_log
WHERE action = 'abandoned'

# 1.6. Write a python class to pull Overall grade of learners for Number of forum posts

In [6]:
class DbConnection:
    def open_local_db(self,**kwargs):
        # Postgres username, password, and database name
        POSTGRES_ADDRESS = '127.0.0.1' 
        POSTGRES_PORT = '5432'
        POSTGRES_USERNAME = kwargs.get('POSTGRES_USERNAME') ##  YOUR POSTGRES USERNAME
        POSTGRES_PASSWORD =kwargs.get('POSTGRES_PASSWORD')## YOUR POSTGRES PASSWORD
        POSTGRES_DBNAME = kwargs.get('POSTGRES_DBNAME') ## YOUR DATABASE NAME
        # A string that contains the necessary Postgres login information
        postgres_str = ('postgresql://{username}:{password}@{ipaddress}:{port}/{dbname}'.format(username=POSTGRES_USERNAME,password=POSTGRES_PASSWORD,ipaddress=POSTGRES_ADDRESS,port=POSTGRES_PORT,dbname=POSTGRES_DBNAME))
        # Create the connection
        connection = create_engine(postgres_str)
        return connection

In [7]:
kwargs = {'POSTGRES_USERNAME':'postgres', 'POSTGRES_PASSWORD': 'Kinglord', 'POSTGRES_DBNAME':'moodle'}

In [8]:
db = DbConnection()
moodle = db.open_local_db(**kwargs)

In [9]:
pd.read_sql_query('''SELECT userid, action,count(action) AS Count FROM mdl_logstore_standard_log 
GROUP BY action ,userid 
ORDER BY count DESC ;''', moodle)

      userid    action  count
0          2   created  12175
1        246      sent  10935
2          2  assigned   9493
3        581      sent   9087
4          2      sent   8025
...      ...       ...    ...
6920     867     saved      1
6921     524   updated      1
6922     226   started      1
6923     921   updated      1
6924     941   awarded      1

[6925 rows x 3 columns]

In [10]:
class pull_():
    # create connection
    conn = psycopg2.connect(host="localhost", port = 5432, database="moodle", user="postgres", password="Kinglord")
    # reading grades as dataframe
    grade_df = pd.read_sql_query('select * from "mdl_grade_grades"',con=conn)
    # reading forum posts as dataframe
    forum_df = pd.read_sql_query('select * from "mdl_forum_posts"',con=conn)
    def grades(self):
        average_grade = np.mean(self.grade_df['finalgrade'])
        print('The average final grade of the students is:', average_grade)
    def posts(self):
        posts_count = self.forum_df['id'].nunique()
        print('The number of forum posts is:', posts_count)  


pull = pull_()
pull.grades()
pull.posts()

The average final grade of the students is: 107.37171772685176
The number of forum posts is: 131

# Task 2- Data Extraction Transformation and Loading (ETL)

In [11]:
df_logstore =  pd.read_sql("select * from mdl_logstore_standard_log", engine)

Dedication Time Computation

In [14]:
user_id =  df_logstore.userid.unique()

d_times = {}

for user in user_id:
    log_user = df_logstore[df_logstore.userid == user].sort_values('timecreated')
    
    d_time = 0 
    isLoggedIn = 0
    loggedIn_timecreated = 0
    
    for i in range(len(log_user)): 
        row = log_user.iloc[i,]
        
        row_next = log_user.iloc[i+1,] if i+1 < len(log_user) else row
        
        if(row.action == "loggedin"): 
            isLoggedIn = 1
            loggedIn_timecreated = row.timecreated

        if( (i+1 == len(log_user)) | ( (row_next.action == "loggedin") & (isLoggedIn == 1) ) ):
            d_time += row.timecreated - loggedIn_timecreated
            isLoggedIn = 0

    d_times[user] = d_time

In [15]:
dedication_time_df = pd.DataFrame({'userid':list(d_times.keys()),
                                  'dedication_time':list(d_times.values())})

In [17]:
dedication_time_df = dedication_time_df.sort_values(by='dedication_time',ascending=False)

In [18]:
dedication_time_df

      userid  dedication_time
0          0       1564600616
25        -1       1564597508
951      944       1563801729
953      938       1563801729
954      937       1563801729
...      ...              ...
976      989           539745
1035    1027           517446
282       22           441628
387      391             2880
3          1               20

[1049 rows x 2 columns]

Login Count Computation

In [9]:

login_count = pd.read_sql_query('''SELECT userid, COUNT(action) AS loginCOUNT from mdl_logstore_standard_log
WHERE action = 'loggedin'
GROUP BY userid
ORDER BY loginCOUNT DESC ''',engine)

In [10]:
login_count.head(10)

   userid  logincount
0       2         169
1     246         113
2       3         107
3     369         100
4     165          91
5     290          73
6     344          68
7     266          64
8      45          63
9      90          57

Activity Count Computation

In [19]:
activity_count = df_logstore[['userid', 'action']]
activity_count_by_user = activity_count.groupby('userid').count().sort_values('action', ascending=False)

In [20]:
activity_count_by_user.head(10)

        action
userid
2        45023
246      13917
3        12922
917      10696
581      10533
290       8558
347       7320
0         7257
607       6461
344       6019

A function to group users in top 1%, 5%, 10% and 25% in:
    dedication time, activity and login count
    it receive a dataframe(for filtering users) and a percent ratio. then returns the top percent in a dataframe

In [13]:
def leaner_percent(df,percent):
    tot_length = df.shape[0]
    top = int((tot_length * percent)/100)
    return df.iloc[:top,]

In [14]:
top_1_percetn_ded = leaner_percent(dedication_time_df, 1)

In [15]:
top_5_percent_ded = leaner_percent(dedication_time_df, 5)

In [16]:
top_10_percent_ded = leaner_percent(dedication_time_df, 10)

In [17]:
top_25_percent_ded = leaner_percent(dedication_time_df, 25)

In [37]:
top_1_percetn_ded.columns = ['top1%_ded']
top_5_percent_ded.columns = ['top5%_ded']
top_10_percent_ded.columns = ['top10%_ded']
top_25_percent_ded.columns = ['top25%_ded']

In [19]:
top_1_percent_log = leaner_percent(login_count, 1)
top_5_percent_log = leaner_percent(login_count, 5)
top_10_percent_log = leaner_percent(login_count, 10)
top_25_percent_log = leaner_percent(login_count, 25)

In [33]:
top_1_percent_log.columns = ['userid','top1%_log']
top_5_percent_log.columns = ['userid','top5%_log']
top_10_percent_log.columns = ['userid','top10%_log']
top_25_percent_log.columns = ['userid','top25%_log']
top_10_percent_log

    userid  top10%_log
0        2         169
1      246         113
2        3         107
3      369         100
4      165          91
5      290          73
6      344          68
7      266          64
8       45          63
9       90          57
10     170          55
11       5          54
12     581          51
13     190          50
14     917          47
15      25          46
16     277          46
17     383          42
18      57          41
19     362          40
20     409          38
21     607          37
22      95          37
23     259          36
24     586          36
25     286          33
26      50          33
27      48          32
28     294          31
29     284          30
30     686          29
31      98          27
32     865          27
33     449          26
34     347          26
35     118          26
36     274          26
37     341          24
38     234          24
39     385          24
40     201          23
41     381          23
42      44          23
43     228          23
44     382          23
45     328          21
46      42          21
47     434          21
48     133          20
49     363          20
50     353          20
51     250          20
52     254          19
53     594          19
54     480          19
55     103          19
56     147          19
57      40          19
58      61          19
59     185          19

In [20]:
top_1_percent_act = leaner_percent(activity_count_by_user, 1)
top_5_percent_act = leaner_percent(activity_count_by_user, 5)
top_10_percent_act = leaner_percent(activity_count_by_user, 10)
top_25_percent_act = leaner_percent(activity_count_by_user, 25)

In [34]:
top_1_percent_act.columns = ['userid','top1%_act']
top_5_percent_act.columns = ['userid','top5%_act']
top_10_percent_act.columns = ['userid','top10%_act']
top_25_percent_act.columns = ['userid','top25%_act']

# Task3- Tableau Visualization

In [ ]:
https://public.tableau.com/profile/jeannette.uwizeye7120#!/vizhome/moodle_log/Dashboard1?publish=yes